pascal-3.2/tutorialsOld/surfaceTracking/interTrackFoam/tank3D_gradLinearFit/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    freeSurface
    {
        type            fixedGradient;
        gradient        uniform (0 0 0);
    }
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 0.25);
    }
    outlet
    {
        type            zeroGradient;
    }
    bottom
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    side-1
    {
        type            slip;
    }
    side-2
    {
        type            slip;
    }
    symm-1
    {
        type            symmetryPlane;
    }
    symm-2
    {
        type            symmetryPlane;
    }
}

// ************************************************************************* //
